<?php
//массив
/*$a=array(1,2,3,4,5);
print_r($a);*/

//массив
/*$a=[1,2,3,4,5];
print_r($a);*/

//выводим 3
/*$a=[1,2,3,4,5];
echo $a[2];*/

//выводим 12345
/*$a=[1,2,3,4,5];
for ($i=0; $i <5 ; $i++) { 
    echo $a[$i];
}*/

//выводит сумму
/*$a=[1,2,3,4,5];
$sum=0;
for ($i=0; $i <5 ; $i++) { 
    $sum=$sum+$a[$i];
}
echo $sum;*/

/*//выводит сумму
$a=[1,2,3,4,5];
$sum=0;
for ($i=0; $i <5 ; $i++) { 
    $sum+=$a[$i];
}
echo $sum;*/

//задаёт ключ с цифры 8
/*$a = [8 => 1, 2, 3, 4, 5];
print_r($a);*/

$a = ['x'=>5, 'y'=>7];
print_r($a);
