<?php
echo "Ведомость учёта работников и их заработных плат";
$vedomost = [
    ["№п/п", "Фамилия", "Имя", "Отчество", "Зарплата"],
    [
        1, "Иванов", "Олег", "Викторович", "500$",
        2, "Фролов", "Андрей", "Леонидович", "300$",
        3, "Чепелов", "Илья", "Игоревич", "200$",
        4, "Семёнов", "Евгений", "Витальевич", "700$",
        5, "Шереметьев", "Игорь", "Фёдорович", "800$",
    ]

];
$tabl = array_chunk($vedomost[1], 5); //разбиваем 2 массив по 5 элементов
unset($vedomost[1]); //удаляет элемент
$a = array_merge($vedomost, $tabl); //сливание 2-х массивов
echo "<table border=3>";
for ($i = 0; $i < count($a); $i++) {
    echo "<tr>";
    for ($j = 0; $j < count($a, COUNT_RECURSIVE); $j++) {
        if ($j >= 5) continue;
        echo "<td>" . $a[$i][$j] . "</td>";
    }
    echo "</tr>";
}
echo "</table>";
